In [24]:
#Q.1 Create a dataset as follow in the table
import pandas as pd

a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
b = ['Yes', 'No', 'No', 'Yes', 'No', 'No', 'Yes', 'No', 'No', 'No']
c = ['s', 'm', 's', 'm', 'd', 'm', 'd', 's', 'm', 's']
d = ['125K', '100K', '70K', '120K', '95K', '60K', '220K', '85K', '75K', '90K']
e = ['No', 'No', 'No', 'No', 'Yes', 'No', 'Yes', 'Yes', 'No', 'Yes']

df = pd.DataFrame({'Tid': a, 'Refund': b, 'Marital Status': c, 'Taxable Income': d, 'Cheat': e})

print(df)

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes              s           125K    No
1    2     No              m           100K    No
2    3     No              s            70K    No
3    4    Yes              m           120K    No
4    5     No              d            95K   Yes
5    6     No              m            60K    No
6    7    Yes              d           220K   Yes
7    8     No              s            85K   Yes
8    9     No              m            75K    No
9   10     No              s            90K   Yes

In [25]:
#Q.2 From the above table that you have created, locate row 0, 4, 7 and 8 using DataFrame.
rows = df.loc[[0, 4, 7, 8]]
print(rows)

   Tid Refund Marital Status Taxable Income Cheat
0    1    Yes              s           125K    No
4    5     No              d            95K   Yes
7    8     No              s            85K   Yes
8    9     No              m            75K    No

In [3]:
# Q.3 Navigate the DataFrame and do the following task for the table created in question 1: 
# 1. Select row from index 3 to 7. 
# 2. Select row from index 4 to 8, and column 2 to 4. 
# 3. Select all rows with column index 1 to 3 (include index 3 during selection).
x = df.loc[3:7]
print(x)

y = df.iloc[4:9, 2:5]
print(y)

z = df.iloc[:, 1:4]
print(z)

   Tid Refund Marital Status Taxable Income Cheat
3    4    Yes              m           120K    No
4    5     No              d            95K   Yes
5    6     No              m            60K    No
6    7    Yes              d           220K   Yes
7    8     No              s            85K   Yes
  Marital Status Taxable Income Cheat
4              d            95K   Yes
5              m            60K    No
6              d           220K   Yes
7              s            85K   Yes
8              m            75K    No
  Refund Marital Status Taxable Income
0    Yes              s           125K
1     No              m           100K
2     No              s            70K
3    Yes              m           120K
4     No              d            95K
5     No              m            60K
6    Yes              d           220K
7     No              s            85K
8     No              m            75K
9     No              s            90K

In [4]:
# Q.4 Read a csv file and display its first five rows. 
# Note-: Download dataset from https://www.kaggle.com/datasets/uciml/iris)
import pandas as pd

df = pd.read_csv(r"C:\Users\prabh\Downloads\Iris.csv")
print(df.head())

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [5]:
# Q.5 From the csv file (uploaded in the Q.4) delete row 4, and delete column 3. Display the 
# resu
df = df.drop(index=4)
df = df.drop(columns=df.columns[3])
print(df)

      Id  SepalLengthCm  SepalWidthCm  PetalWidthCm         Species
0      1            5.1           3.5           0.2     Iris-setosa
1      2            4.9           3.0           0.2     Iris-setosa
2      3            4.7           3.2           0.2     Iris-setosa
3      4            4.6           3.1           0.2     Iris-setosa
5      6            5.4           3.9           0.4     Iris-setosa
..   ...            ...           ...           ...             ...
145  146            6.7           3.0           2.3  Iris-virginica
146  147            6.3           2.5           1.9  Iris-virginica
147  148            6.5           3.0           2.0  Iris-virginica
148  149            6.2           3.4           2.3  Iris-virginica
149  150            5.9           3.0           1.8  Iris-virginica

[149 rows x 5 columns]

In [6]:
# Q.6 Create a sample dataset (employees.csv) containing information about employees in 
# a company. 

import pandas as pd

data = {
    "Employee_ID": [101, 102, 103, 104, 105],
    "Name": ["Alice", "Bob", "Charlie", "Diana", "Edward"],
    "Department": ["HR", "IT", "IT", "Marketing", "Sales"],
    "Age": [29, 34, 41, 28, 38],
    "Salary": [50000, 70000, 65000, 55000, 60000],
    "Years_of_Experience": [4, 8, 10, 3, 12],
    "Joining_Date": ["2020-03-15", "2017-07-19", "2013-06-01", "2021-02-10", "2010-11-25"],
    "Gender": ["Female", "Male", "Male", "Female", "Male"],
    "Bonus": [5000, 7000, 6000, 4500, 5000],
    "Rating": [4.5, 4.0, 3.8, 4.7, 3.5]
}

df = pd.DataFrame(data)

df.to_csv("employees.csv", index=False)
print(df)

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

In [7]:
# a) Shape (number of rows and columns) of the DataFrame
print( df.shape)

(5, 10)

In [8]:
# b) Summary of the DataFrame that includes the data types and non-null counts for 
# each column.
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Employee_ID          5 non-null      int64
 1   Name                 5 non-null      object
 2   Department           5 non-null      object
 3   Age                  5 non-null      int64
 4   Salary               5 non-null      int64
 5   Years_of_Experience  5 non-null      int64
 6   Joining_Date         5 non-null      object
 7   Gender               5 non-null      object
 8   Bonus                5 non-null      int64
 9   Rating               5 non-null      float64
dtypes: float64(1), int64(5), object(4)
memory usage: 532.0+ bytes
None

In [9]:
# c) Generate descriptive statistics
print(df.describe())

       Employee_ID        Age       Salary  Years_of_Experience   Bonus  \
count     5.000000   5.000000      5.00000             5.000000     5.0
mean    103.000000  34.000000  60000.00000             7.400000  5500.0
std       1.581139   5.612486   7905.69415             3.847077  1000.0
min     101.000000  28.000000  50000.00000             3.000000  4500.0
25%     102.000000  29.000000  55000.00000             4.000000  5000.0
50%     103.000000  34.000000  60000.00000             8.000000  5000.0
75%     104.000000  38.000000  65000.00000            10.000000  6000.0
max     105.000000  41.000000  70000.00000            12.000000  7000.0

         Rating
count  5.000000
mean   4.100000
std    0.494975
min    3.500000
25%    3.800000
50%    4.000000
75%    4.500000
max    4.700000

In [10]:
# d) Display the first 5 rows and last 3 rows of the dataset
print(df.head())

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
0          101    Alice         HR   29   50000                    4
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
0   2020-03-15  Female   5000     4.5
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

In [11]:
print(df.tail(3))

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
2          103  Charlie         IT   41   65000                   10
3          104    Diana  Marketing   28   55000                    3
4          105   Edward      Sales   38   60000                   12

  Joining_Date  Gender  Bonus  Rating
2   2013-06-01    Male   6000     3.8
3   2021-02-10  Female   4500     4.7
4   2010-11-25    Male   5000     3.5

In [12]:
# e) Calculate the following statistics from the dataset: 
# i. The average salary of employees. 
# ii. The total bonus paid to all employees. 
# iii. The youngest employee's age. 
# iv. The highest performance rating
average_salary = df['Salary'].mean()
print( average_salary)

60000.0

In [13]:
total_bonus = df['Bonus'].sum()
print( total_bonus)

27500

In [14]:
youngest_age = df['Age'].min()
print( youngest_age)

28

In [15]:
# f) Sort the DataFrame by the Salary column in descending order.
sorted_df = df.sort_values(by='Salary', ascending=False)
print(sorted_df)

   Employee_ID     Name Department  Age  Salary  Years_of_Experience  \
1          102      Bob         IT   34   70000                    8
2          103  Charlie         IT   41   65000                   10
4          105   Edward      Sales   38   60000                   12
3          104    Diana  Marketing   28   55000                    3
0          101    Alice         HR   29   50000                    4

  Joining_Date  Gender  Bonus  Rating
1   2017-07-19    Male   7000     4.0
2   2013-06-01    Male   6000     3.8
4   2010-11-25    Male   5000     3.5
3   2021-02-10  Female   4500     4.7
0   2020-03-15  Female   5000     4.5

In [16]:
# g) Add a new column that categorizes employees based on their performance rating: 
# i. Excellent for ratings >= 4.5 
# ii. Good for ratings >= 4.0 but < 4.5 
# iii. Average for ratings < 4.0 

def categorize_performance(rating):
    if rating >= 4.5:
        return 'Excellent'
    elif rating >= 4.0:
        return 'Good'
    else:
        return 'Average'
df['Performance_Category'] = df['Rating'].apply(categorize_performance)
print(df[['Name', 'Rating', 'Performance_Category']])

      Name  Rating Performance_Category
0    Alice     4.5            Excellent
1      Bob     4.0                 Good
2  Charlie     3.8              Average
3    Diana     4.7            Excellent
4   Edward     3.5              Average

In [17]:
# h) Identify missing values in the DataFrame.
missing_values = df.isnull().sum()
print(missing_values)

Employee_ID             0
Name                    0
Department              0
Age                     0
Salary                  0
Years_of_Experience     0
Joining_Date            0
Gender                  0
Bonus                   0
Rating                  0
Performance_Category    0
dtype: int64

In [18]:
# i) Rename the Employee_ID column to ID.
df.rename(columns={'Employee_ID': 'ID'}, inplace=True)
print(df)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance_Category
0  Female   5000     4.5            Excellent
1    Male   7000     4.0                 Good
2    Male   6000     3.8              Average
3  Female   4500     4.7            Excellent
4    Male   5000     3.5              Average

In [19]:
# j) Find all employees who: 
# i. Have more than 5 years of experience. 
# ii. Belong to the IT department. 

more_than_5_years_exp = df[df['Years_of_Experience'] > 5]
print(more_than_5_years_exp)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
4  105   Edward      Sales   38   60000                   12   2010-11-25

  Gender  Bonus  Rating Performance_Category
1   Male   7000     4.0                 Good
2   Male   6000     3.8              Average
4   Male   5000     3.5              Average

In [20]:

it_department = df[df['Department'] == 'IT']
print(it_department)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01

  Gender  Bonus  Rating Performance_Category
1   Male   7000     4.0                 Good
2   Male   6000     3.8              Average

In [21]:
df['Tax'] = df['Salary'] * 0.10
print(df)

    ID     Name Department  Age  Salary  Years_of_Experience Joining_Date  \
0  101    Alice         HR   29   50000                    4   2020-03-15
1  102      Bob         IT   34   70000                    8   2017-07-19
2  103  Charlie         IT   41   65000                   10   2013-06-01
3  104    Diana  Marketing   28   55000                    3   2021-02-10
4  105   Edward      Sales   38   60000                   12   2010-11-25

   Gender  Bonus  Rating Performance_Category     Tax
0  Female   5000     4.5            Excellent  5000.0
1    Male   7000     4.0                 Good  7000.0
2    Male   6000     3.8              Average  6500.0
3  Female   4500     4.7            Excellent  5500.0
4    Male   5000     3.5              Average  6000.0

In [22]:
df.to_csv("modified_employees.csv", index=False)